Tekla Open API Reference for Tekla Structures 2025
ReinforcementMesh.Attributes Property
 The attributes of the reinforcement. For more information see ReinforcementBase.ReinforcementMeshAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReinforcementBase.ReinforcementMeshAttributes Attributes { get; set; }
Public Property Attributes As ReinforcementBase.ReinforcementMeshAttributes
	Get
	Set
Property Value
Type: ReinforcementBase.ReinforcementMeshAttributes
See Also
Reference
ReinforcementMesh Class
Tekla.Structures.Drawing Namespace